[Killed] BlockStatement
src/binarySearch.js:7:36
  * Búsqueda binaria iterativa sobre un arreglo ordenado ascendentemente.
  */
 
-function binarySearch(arr, target) {
-  if (!Array.isArray(arr)) {
-    throw new TypeError("El primer argumento debe ser un arreglo.");
-  }
-
-  let left = 0;
-  let right = arr.length - 1;
-
-  while (left <= right) {
-    const mid = Math.floor((left + right) / 2);
-    if (arr[mid] === target) {
-      return mid;
-    } else if (arr[mid] < target) {
-      left = mid + 1;
-    } else {
-      right = mid - 1;
-    }
-  }
-
-  return -1;
-}
+function binarySearch(arr, target) {}
 
 module.exports = { binarySearch };
killedBy: Búsqueda binaria - Pruebas funcionales encuentra un elemento existente en el arreglo
statusReason: Expected undefined to be 5.

[Killed] ConditionalExpression
src/binarySearch.js:8:7
  */
 
 function binarySearch(arr, target) {
-  if (!Array.isArray(arr)) {
+  if (true) {
     throw new TypeError("El primer argumento debe ser un arreglo.");
   }
killedBy: Búsqueda binaria - Pruebas funcionales encuentra un elemento existente en el arreglo
statusReason: TypeError: El primer argumento debe ser un arreglo.

[Killed] BooleanLiteral
src/binarySearch.js:8:7
  */
 
 function binarySearch(arr, target) {
-  if (!Array.isArray(arr)) {
+  if (Array.isArray(arr)) {
     throw new TypeError("El primer argumento debe ser un arreglo.");
   }
killedBy: Búsqueda binaria - Pruebas funcionales encuentra un elemento existente en el arreglo
statusReason: TypeError: El primer argumento debe ser un arreglo.

[Killed] EqualityOperator
src/binarySearch.js:15:10
   let left = 0;
   let right = arr.length - 1;
 
-  while (left <= right) {
+  while (left < right) {
     const mid = Math.floor((left + right) / 2);
     if (arr[mid] === target) {
killedBy: Búsqueda binaria - Pruebas funcionales encuentra el primer elemento
statusReason: Expected -1 to be 0.

[Killed] EqualityOperator
src/binarySearch.js:15:10
   let left = 0;
   let right = arr.length - 1;
 
-  while (left <= right) {
+  while (left > right) {
     const mid = Math.floor((left + right) / 2);
     if (arr[mid] === target) {
killedBy: Búsqueda binaria - Pruebas funcionales encuentra un elemento existente en el arreglo
statusReason: Expected -1 to be 5.

[Killed] ConditionalExpression
src/binarySearch.js:17:9
 
   while (left <= right) {
     const mid = Math.floor((left + right) / 2);
-    if (arr[mid] === target) {
+    if (false) {
       return mid;
     } else if (arr[mid] < target) {
killedBy: Búsqueda binaria - Pruebas funcionales encuentra un elemento existente en el arreglo
statusReason: Expected -1 to be 5.

[Killed] ConditionalExpression
src/binarySearch.js:17:9
 
   while (left <= right) {
     const mid = Math.floor((left + right) / 2);
-    if (arr[mid] === target) {
+    if (true) {
       return mid;
     } else if (arr[mid] < target) {
killedBy: Búsqueda binaria - Pruebas funcionales encuentra un elemento existente en el arreglo
statusReason: Expected 4 to be 5.

[Killed] ConditionalExpression
src/binarySearch.js:19:16
     const mid = Math.floor((left + right) / 2);
     if (arr[mid] === target) {
       return mid;
-    } else if (arr[mid] < target) {
+    } else if (false) {
       left = mid + 1;
     } else {
killedBy: Búsqueda binaria - Pruebas funcionales encuentra un elemento existente en el arreglo
statusReason: Expected -1 to be 5.

[Killed] EqualityOperator
src/binarySearch.js:19:16
     const mid = Math.floor((left + right) / 2);
     if (arr[mid] === target) {
       return mid;
-    } else if (arr[mid] < target) {
+    } else if (arr[mid] >= target) {
       left = mid + 1;
     } else {
killedBy: Búsqueda binaria - Pruebas funcionales encuentra un elemento existente en el arreglo
statusReason: Expected -1 to be 5.

[Timeout] ArithmeticOperator
src/binarySearch.js:20:14
     if (arr[mid] === target) {
       return mid;
     } else if (arr[mid] < target) {
-      left = mid + 1;
+      left = mid - 1;
     } else {
       right = mid - 1;

[Killed] ObjectLiteral
src/binarySearch.js:29:18
   return -1;
 }
 
-module.exports = { binarySearch };
+module.exports = {};
killedBy: Búsqueda binaria - Pruebas funcionales encuentra un elemento existente en el arreglo
statusReason: TypeError: binarySearch is not a function
